[
    {
        "originalName": "アワアワの実",
        "romanizedName": "Awa Awa no Mi",
        "englishName": "Bubble-Bubble Fruit",
        "meaning": "Bubble Fruit",
        "type": "PARAMECIA",
        "debutChapter": "379",
        "debutEpisode": "266",
        "debutArc": "Enies Lobby",
        "currentHolder": "Kalifa",
        "pastHolders": ["Kalifa"],
        "description": "The Awa Awa no Mi, also known as the Bubble-Bubble Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create and control soap bubbles. These bubbles can clean anything, including physical objects and even the strength of opponents, effectively weakening them. It is currently held by Kalifa, a member of CP9. While the bubbles are visually harmless, they are a powerful tool in combat, allowing the user to disarm and debilitate enemies with ease. The fruit's unique ability to 'clean' strength makes it a formidable weapon in the hands of a skilled user. Despite its whimsical appearance, the Awa Awa no Mi is a dangerous and versatile fruit that has proven its effectiveness in battle. Its awakening status remains unknown, and it has not been shown to have any previous holders.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/awa_awa.png"
    },
    {
        "originalName": "バクバクの実",
        "romanizedName": "Baku Baku Fruit",
        "englishName": "Munch-Munch Fruit",
        "meaning": "Sound of chomping",
        "type": "PARAMECIA",
        "debutChapter": "131",
        "debutEpisode": "79",
        "debutArc": "Drum Island",
        "currentHolder": "Wapol",
        "pastHolders": ["Wapol"],
        "description": "The Baku Baku no Mi, also known as the Munch-Munch Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to eat anything and merge it with their own body. This includes inanimate objects, weapons, and even living beings, allowing the user to reshape their body in unique and creative ways. The fruit's power is currently held by Wapol, the former king of Drum Island. Its abilities are often used for both combat and utility, enabling the user to adapt to various situations by consuming and integrating useful materials. Despite its seemingly bizarre nature, the Baku Baku no Mi is a versatile and powerful fruit that has been used to devastating effect. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's unique ability to transform the user into a living amalgamation makes it a fascinating and dangerous power.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/baku_baku.png"
    },
    {
        "originalName": "バラバラの実",
        "romanizedName": "Bara Bara no Mi",
        "englishName": "Chop-Chop Fruit",
        "meaning": "Scattered: in pieces",
        "type": "PARAMECIA",
        "debutChapter": "19",
        "debutEpisode": "8",
        "debutArc": "Orange Town",
        "currentHolder": "Buggy",
        "pastHolders": ["Buggy"],
        "description": "The Bara Bara no Mi, also known as the Chop-Chop Fruit, is a Paramecia-type Devil Fruit that grants its user immunity to being cut or sliced, as well as the ability to split their body into pieces and control them at will. This power is currently held by Buggy, the leader of the Buggy Pirates. The fruit's abilities make the user immune to slashing attacks, as their body parts can separate and reassemble without harm. This unique power is particularly effective in combat, allowing the user to evade attacks and launch surprise offensives. Despite its comedic appearance, the Bara Bara no Mi is a formidable fruit that has proven its worth in battle. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's ability to render the user immune to cutting attacks makes it a valuable asset in combat scenarios.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/bara_bara.png"
    },
    {
        "originalName": "バリバリの実",
        "romanizedName": "Bari Bari no Mi",
        "englishName": "Barrier-Barrier Fruit",
        "meaning": "Barrier",
        "type": "PARAMECIA",
        "debutChapter": "708",
        "debutEpisode": "637",
        "debutArc": "Dressrosa",
        "currentHolder": "Bartolomeo",
        "pastHolders": ["Bartolomeo","Kurozumi Semimaru"],
        "description": "The Bari Bari no Mi, also known as the Barrier-Barrier Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create impenetrable barriers. These barriers can be used for both offense and defense, making the fruit highly versatile in combat. The fruit is currently held by Bartolomeo, a devoted fan of the Straw Hat Pirates, who uses its powers to protect his allies and overpower his enemies. Previously, it was held by Kurozumi Semimaru, who utilized its abilities during the Wano Country arc. The barriers are invisible and indestructible, capable of withstanding even the most powerful attacks. Despite its simplicity, the Bari Bari no Mi is a formidable fruit that has proven its worth in various battles. Its awakening status remains unknown, and its full potential has yet to be explored. The fruit's defensive capabilities make it a valuable asset in any confrontation.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/bari_bari.png"
    },
    {
        "originalName": "バットバットの実 モデル“バンパイア”",
        "romanizedName": "Batto Batto no Mi: Moderu Banpaia",
        "englishName": "Bat-Bat Fruit, Model: Vampire",
        "meaning": "Bat",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Patrick Redfield",
        "pastHolders": ["Patrick Redfield"],
        "description": "The Batto Batto no Mi, Model: Vampire, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into a vampire or a vampire hybrid at will. This fruit provides enhanced physical abilities, such as superhuman strength, speed, and agility, as well as the ability to drain the life force of others to heal injuries or extend the user's lifespan. It is currently held by Patrick Redfield, a character from non-canon media. The fruit's powers make it a formidable tool in combat, allowing the user to dominate opponents with both brute force and strategic life-draining abilities. Despite its non-canon status, the Batto Batto no Mi, Model: Vampire, is a fascinating and powerful fruit that showcases the versatility of Mythical Zoan abilities. Its awakening status remains unknown, and no previous holders have been documented. The fruit's vampiric nature adds a unique twist to its capabilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/batto_batto.png"
    },
    {
        "originalName": "ベリベリの実",
        "romanizedName": "Beri Beri no Mi",
        "englishName": "Berry-Berry Fruit",
        "meaning": "Berry",
        "type": "PARAMECIA",
        "debutChapter": "426",
        "debutEpisode": "309",
        "debutArc": "Water 7",
        "currentHolder": "Very Good",
        "pastHolders": ["Very Good"],
        "description": "The Beri Beri no Mi, also known as the Berry-Berry Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to split their body into multiple spherical segments resembling berries. This power is currently held by Very Good, a Marine officer. The fruit's abilities allow the user to disassemble their body into berry-like spheres that can be used for both offense and defense. The user can control these spheres independently, making them difficult to predict in combat. The fruit's unique design and abilities make it a fascinating addition to the world of Devil Fruits. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's spherical nature adds a whimsical yet dangerous element to its capabilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/beri_beri.png"
    },
    {
        "originalName": "ビジョビジョの実",
        "romanizedName": "Bijo Bijo no Mi",
        "englishName": "Vision-Vision Fruit",
        "meaning": "Vision",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Ann",
        "pastHolders": ["Ann"],
        "description": "The Bijo Bijo no Mi, also known as the Vision-Vision Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to project and manipulate visual illusions. This power is currently held by Ann, a character from non-canon media. The fruit's abilities allow the user to create realistic illusions that can deceive opponents, confuse enemies, or provide tactical advantages in combat. These illusions can range from simple distractions to complex scenarios, making the fruit highly versatile. Despite its non-canon status, the Bijo Bijo no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of illusion-based powers. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to manipulate perception adds a unique and strategic element to its capabilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/bijo_bijo.png"
    },
    {
        "originalName": "ボムボムの実",
        "romanizedName": "Bomu Bomu no Mi",
        "englishName": "Bomb-Bomb Fruit",
        "meaning": "Bomb",
        "type": "PARAMECIA",
        "debutChapter": "110",
        "debutEpisode": "65",
        "debutArc": "Whisky Peak",
        "currentHolder": "Gem",
        "pastHolders": ["Gem"],
        "description": "The Bomu Bomu no Mi, also known as the Bomb-Bomb Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to cause explosions from any part of their body without harming themselves. This power is currently held by Gem, also known as Mr. 5, a former officer agent of Baroque Works. The fruit's abilities allow the user to turn their body into a living weapon, capable of creating powerful explosions for both offense and defense. The user can also detonate objects they touch, adding versatility to their combat style. Despite its destructive nature, the fruit requires strategic use to maximize its potential. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Bomu Bomu no Mi's explosive capabilities make it a dangerous and effective tool in battle, capable of overwhelming opponents with sheer force.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/bomu_bomu.png"
    },
    {
        "originalName": "チユチユの実",
        "romanizedName": "Chiyu Chiyu no Mi",
        "englishName": "Heal-Heal Fruit",
        "meaning": "Healing",
        "type": "PARAMECIA",
        "debutChapter": "774",
        "debutEpisode": "714",
        "debutArc": "Dressrosa",
        "currentHolder": "Mansherry",
        "pastHolders": ["Mansherry"],
        "description": "The Chiyu Chiyu no Mi, also known as the Heal-Heal Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to heal injuries and ailments of others. This power is currently held by Mansherry, a Tontatta dwarf from the Dressrosa Kingdom. The fruit's abilities allow the user to produce healing tears that can mend wounds and restore vitality, making it an invaluable asset in both combat and medical scenarios. However, the fruit's powers have limitations, as excessive use can lead to exhaustion or unintended consequences. Despite its seemingly benevolent nature, the fruit's abilities can be exploited for strategic purposes, such as manipulating allies or enemies. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Chiyu Chiyu no Mi's healing capabilities make it a unique and powerful tool in the world of Devil Fruits.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/chiyu_chiyu.png"
    },
    {
        "originalName": "ドアドアの実",
        "romanizedName": "Doa Doa no Mi",
        "englishName": "Door-Door Fruit",
        "meaning": "Door",
        "type": "PARAMECIA",
        "debutChapter": "326",
        "debutEpisode": "231",
        "debutArc": "Water 7",
        "currentHolder": "Blueno",
        "pastHolders": ["Blueno"],
        "description": "The Doa Doa no Mi, also known as the Door-Door Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create doors on any surface, including the air itself. This power is currently held by Blueno, a member of CP9. The fruit's abilities allow the user to manipulate space by creating doors that lead to different locations or even a separate dimension known as the 'door dimension.' This unique ability provides both offensive and defensive advantages, enabling the user to evade attacks, ambush opponents, or escape from dangerous situations. Despite its seemingly simple concept, the Doa Doa no Mi is a versatile and strategic fruit that has proven its effectiveness in combat. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's spatial manipulation capabilities make it a valuable asset in various scenarios.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/doa_doa.png"
    },
    {
        "originalName": "ドクドクの実",
        "romanizedName": "Doku Doku no Mi",
        "englishName": "Venom-Venom Fruit",
        "meaning": "Poison",
        "type": "PARAMECIA",
        "debutChapter": "528",
        "debutEpisode": "425",
        "debutArc": "Impel Down",
        "currentHolder": "Magellan",
        "pastHolders": ["Magellan"],
        "description": "The Doku Doku no Mi, also known as the Venom-Venom Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to produce and control various types of poison. This power is currently held by Magellan, the vice warden of Impel Down. The fruit's abilities allow the user to create highly toxic substances that can incapacitate or kill opponents, as well as form defensive barriers and offensive attacks. Magellan's mastery of the fruit has made him a fearsome opponent, capable of overwhelming enemies with his deadly poison techniques. Despite its immense power, the fruit's abilities come with drawbacks, such as the risk of collateral damage and the user's own vulnerability to their poison if not handled carefully. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Doku Doku no Mi's toxic capabilities make it a formidable weapon in battle.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/doku_doku.png"
    },
    {
        "originalName": "ドルドルの実",
        "romanizedName": "Doru Doru no mi",
        "englishName": "Wax-Wax Fruit",
        "meaning": "Candle",
        "type": "PARAMECIA",
        "debutChapter": "118",
        "debutEpisode": "71",
        "debutArc": "Arabasta",
        "currentHolder": "Galdino",
        "pastHolders": ["Galdino"],
        "description": "The Doru Doru no Mi, also known as the Wax-Wax Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create and manipulate wax at will. This power is currently held by Galdino, also known as Mr. 3, a former officer agent of Baroque Works. The fruit's abilities allow the user to produce wax that can harden into various shapes and structures, providing both offensive and defensive capabilities. The wax is as strong as steel when hardened, making it a versatile tool in combat. The user can create weapons, shields, and even intricate sculptures, showcasing the fruit's creative potential. Despite its utility, the fruit's effectiveness depends on the user's ingenuity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Doru Doru no Mi's wax manipulation abilities make it a unique and resourceful Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/doru_doru.png"
    },
    {
        "originalName": "フデフデの実",
        "romanizedName": "Fude Fude no Mi",
        "englishName": "Brush-Brush Fruit",
        "meaning": "Brush",
        "type": "PARAMECIA",
        "debutChapter": "754",
        "debutEpisode": "691",
        "debutArc": "Dressrosa",
        "currentHolder": "Kurozumi Kanjuro",
        "pastHolders": ["Kurozumi Kanjuro"],
        "description": "The Fude Fude no Mi, also known as the Brush-Brush Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to bring drawings to life. This power is currently held by Kurozumi Kanjuro, a member of the Kurozumi Family. The fruit's abilities allow the user to create living creatures, objects, or scenarios by drawing them with a brush. The quality and effectiveness of the creations depend on the user's artistic skill and imagination. This unique ability provides both offensive and defensive advantages, enabling the user to summon allies, create obstacles, or launch attacks. Despite its creative potential, the fruit's power requires strategic use and artistic talent to maximize its effectiveness. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Fude Fude no Mi's artistic capabilities make it a versatile and intriguing addition to the world of Devil Fruits.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/fude_fude.png"
    },
    {
        "originalName": "フワフワの実",
        "romanizedName": "Fuwa Fuwa no Mi",
        "englishName": "Float-Float Fruit",
        "meaning": "Float",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Shiki",
        "pastHolders": ["Shiki"],
        "description": "The Fuwa Fuwa no Mi, also known as the Float-Float Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to make themselves and non-living objects float. This power is currently held by Shiki, the notorious Golden Lion, who uses it to manipulate massive objects such as ships and islands, turning them into devastating weapons. The fruit's abilities provide unparalleled mobility and strategic advantages, allowing the user to dominate both land and aerial combat. Despite its immense power, the fruit's effectiveness depends on the user's creativity and tactical prowess. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Fuwa Fuwa no Mi's ability to defy gravity makes it one of the most versatile and dangerous Devil Fruits in existence, capable of reshaping the battlefield and overwhelming opponents with sheer ingenuity.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/fuwa_fuwa.png"
    },
    {
        "originalName": "ガシャガシャの実",
        "romanizedName": "Gasha Gasha no Mi",
        "englishName": "Clank-Clank Fruit",
        "meaning": "Sound of metal clanking",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Douglas Bullet",
        "pastHolders": ["Douglas Bullet"],
        "description": "The Gasha Gasha no Mi, also known as the Clank-Clank Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to assemble and manipulate mechanical constructs from surrounding materials. This power is currently held by Douglas Bullet, a character from non-canon media. The fruit's abilities allow the user to create complex machinery and weapons, providing both offensive and defensive advantages in combat. The user can combine various objects to form massive constructs, showcasing the fruit's potential for large-scale destruction and innovation. Despite its non-canon status, the Gasha Gasha no Mi is a fascinating addition to the world of Devil Fruits, highlighting the creative possibilities of mechanical manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's mechanical assembly capabilities make it a versatile and powerful tool, capable of overwhelming opponents with ingenuity and brute force.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/gasha_gasha.png"
    },
    {
        "originalName": "ガスガスの実",
        "romanizedName": "Gasu Gasu no Mi",
        "englishName": "Gas-Gas Fruit",
        "meaning": "Gas",
        "type": "LOGIA",
        "debutChapter": "658",
        "debutEpisode": "581",
        "debutArc": "Punk Hazard",
        "currentHolder": "Caesar Clown",
        "pastHolders": ["Caesar Clown"],
        "description": "The Gasu Gasu no Mi, also known as the Gas-Gas Fruit, is a Logia-type Devil Fruit that grants its user the ability to transform into, create, and control gas. This power is currently held by Caesar Clown, a former scientist of the World Government. The fruit's abilities allow the user to manipulate various types of gases, including toxic and explosive ones, making it a versatile tool for both combat and scientific experimentation. The user can also remove oxygen from the air, suffocating opponents or creating a vacuum. Despite its immense power, the fruit's effectiveness depends on the user's knowledge of gases and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Gasu Gasu no Mi's ability to manipulate gases makes it a dangerous and resourceful Devil Fruit, capable of overwhelming enemies with its versatility.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/gasu_gasu.png"
    },
    {
        "originalName": "ゴムゴムの実",
        "romanizedName": "Gomu Gomu no Mi",
        "englishName": "Gum-Gum Fruit",
        "meaning": "Rubber",
        "type": "PARAMECIA",
        "debutChapter": "1",
        "debutEpisode": "1",
        "debutArc": "East Blue",
        "currentHolder": "Monkey D. Luffy",
        "pastHolders": ["Monkey D. Luffy", "Joy Boy"],
        "description": "The Gomu Gomu no Mi, also known as the Gum-Gum Fruit, is a mysterious Devil Fruit that grants its user a body with the properties of rubber. This power is currently held by Monkey D. Luffy, the captain of the Straw Hat Pirates. The fruit's abilities allow the user to stretch, expand, and bounce their body, providing unique advantages in combat and mobility. Despite its seemingly simple nature, the fruit's potential is vast, as demonstrated by Luffy's creative and evolving techniques. The fruit's origins and true nature remain shrouded in mystery, with hints of a deeper connection to the legendary figure Joy Boy. Its awakening status remains unknown, and its full capabilities have yet to be revealed. The Gomu Gomu no Mi's rubber-like properties make it a versatile and iconic Devil Fruit, central to Luffy's journey and the overarching narrative of the One Piece world.",
        "awakeningStatus": true,
        "awakeningDescription": "Once the fruit is awakened, the user undergoes a drastic transformation where their hair and clothing turns white, their hair resembles flames, their eyebrows resemble spirals, and gains ringed pupils, in addition to steam wrapped around him. ",
        "isCanon": true,
        "imageUrl": "/images/gomu_gomu.png"
    },
    {
        "originalName": "ゴロゴロの実",
        "romanizedName": "Goro Goro no Mi",
        "englishName": "Rumble-Rumble Fruit",
        "meaning": "Sound of Thunder",
        "type": "LOGIA",
        "debutChapter": "241",
        "debutEpisode": "155",
        "debutArc": "Skypiea",
        "currentHolder": "Enel",
        "pastHolders": ["Enel"],
        "description": "The Goro Goro no Mi, also known as the Rumble-Rumble Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into electricity. This power is currently held by Enel, the self-proclaimed God of Skypiea. The fruit's abilities allow the user to unleash devastating electrical attacks, travel at lightning speed, and manipulate electrical currents for various purposes. Enel's mastery of the fruit has made him a nearly invincible opponent, capable of overwhelming enemies with sheer power and precision. Despite its immense strength, the fruit's effectiveness depends on the user's strategic use of electricity and their ability to exploit its weaknesses. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Goro Goro no Mi's electrical capabilities make it one of the most powerful and feared Devil Fruits in existence.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/goro_goro.png"
    },
    {
        "originalName": "ゴルゴルの実",
        "romanizedName": "Goru Goru no Mi",
        "englishName": "Gold-Gold Fruit",
        "meaning": "Gold",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Gild Tesoro",
        "pastHolders": ["Gild Tesoro"],
        "description": "The Goru Goru no Mi, also known as the Gold-Gold Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate and control gold. This power is currently held by Gild Tesoro, a character from non-canon media. The fruit's abilities allow the user to reshape gold into various forms, such as weapons, armor, or intricate structures, providing both offensive and defensive advantages. The user can also manipulate gold on a massive scale, showcasing the fruit's potential for large-scale destruction and control. Despite its non-canon status, the Goru Goru no Mi is a fascinating addition to the world of Devil Fruits, highlighting the creative possibilities of gold manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to control gold makes it a versatile and powerful tool, capable of overwhelming opponents with ingenuity and brute force.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/goru_goru.png"
    },
    {
        "originalName": "グラグラの実",
        "romanizedName": "Gura Gura no Mi",
        "englishName": "Quake-Quake Fruit",
        "meaning": "Sound of Shaking",
        "type": "PARAMECIA",
        "debutChapter": "552",
        "debutEpisode": "461",
        "debutArc": "Marineford",
        "currentHolder": "Marshall D. Teach",
        "pastHolders": ["Marshall D. Teach","Edward Newgate"],
        "description": "The Gura Gura no Mi, also known as the Quake-Quake Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create powerful shockwaves, capable of causing massive destruction. This power is currently held by Marshall D. Teach, also known as Blackbeard, who acquired it after the death of its previous user, Edward Newgate, also known as Whitebeard. The fruit's abilities allow the user to generate vibrations that can shatter objects, create tsunamis, and even disrupt the very air and ground. It is considered one of the most destructive Devil Fruits in existence, capable of devastating entire landscapes and overwhelming opponents with sheer force. Despite its immense power, the fruit requires precise control to avoid unintended collateral damage. Its awakening status remains unknown, and its full potential has yet to be explored. The Gura Gura no Mi's seismic capabilities make it a fearsome weapon in battle.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/gura_gura.png"
    },
    {
        "originalName": "グルグルの実",
        "romanizedName": "Guru Guru no Mi",
        "englishName": "Spin-Spin Fruit",
        "meaning": "Sound of rotating",
        "type": "PARAMECIA",
        "debutChapter": "692",
        "debutEpisode": "618",
        "debutArc": "Punk Hazard",
        "currentHolder": "Buffalo",
        "pastHolders": ["Buffalo"],
        "description": "The Guru Guru no Mi, also known as the Spin-Spin Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to rotate any part of their body at high speeds, effectively turning them into a living propeller. This power is currently held by Buffalo, a member of the Donquixote Pirates. The fruit's abilities allow the user to achieve flight by spinning their body, as well as generate powerful rotational attacks. The user can also use their spinning capabilities to create strong winds or deflect projectiles, showcasing the fruit's versatility in combat. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Guru Guru no Mi's rotational capabilities make it a unique and resourceful Devil Fruit, capable of surprising opponents with its dynamic abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/guru_guru.png"
    },
    {
        "originalName": "グツグツの実",
        "romanizedName": "Gutsu Gutsu no Mi",
        "englishName": "Smelt-Smelt Fruit",
        "meaning": "Sound of boiling",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Lambor Bukini",
        "pastHolders": ["Lambor Bukini"],
        "description": "The Gutsu Gutsu no Mi, also known as the Smelt-Smelt Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to melt and manipulate metals at will. This power is currently held by Lambor Bukini, a character from non-canon media. The fruit's abilities allow the user to smelt metals into liquid form and reshape them into various tools, weapons, or structures, providing both offensive and defensive advantages. The user can also control the temperature of the molten metal, making it a versatile tool in combat and construction. Despite its non-canon status, the Gutsu Gutsu no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of metal manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to manipulate molten metal makes it a powerful and resourceful tool in various scenarios.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/gutsu_gutsu.png"
    },
    {
        "originalName": "ハナハナの実",
        "romanizedName": "Hana Hana no Mi",
        "englishName": "Flower-Flower Fruit",
        "meaning": "Flower: Blossom",
        "type": "PARAMECIA",
        "debutChapter": "114",
        "debutEpisode": "67",
        "debutArc": "Whisky Peak",
        "currentHolder": "Nico Robin",
        "pastHolders": ["Nico Robin"],
        "description": "The Hana Hana no Mi, also known as the Flower-Flower Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to sprout replicas of their body parts on any surface within range. This power is currently held by Nico Robin, a member of the Straw Hat Pirates. The fruit's abilities allow the user to create hands, eyes, or other body parts to perform various tasks, such as combat, reconnaissance, or support. The user can also combine multiple replicas to form larger constructs, showcasing the fruit's versatility and creativity. Despite its seemingly benign nature, the Hana Hana no Mi is a powerful tool in the hands of a skilled user, capable of overwhelming opponents with sheer numbers or precision strikes. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's unique replication ability makes it a valuable asset in any scenario.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hana_hana.png"
    },
    {
        "originalName": "ヘビヘビの実 モデル アナコンダ",
        "romanizedName": "Hebi Hebi no Mi, Moderu: Anakonda",
        "englishName": "Snake-Snake Fruit: Model Anaconda",
        "meaning": "Snake",
        "type": "ZOAN",
        "debutChapter": "518",
        "debutEpisode": "412",
        "debutArc": "Amazon Lily",
        "currentHolder": "Boa Sandersonia",
        "pastHolders": ["Boa Sandersonia"],
        "description": "The Hebi Hebi no Mi, Model: Anaconda, is a Zoan-type Devil Fruit that grants its user the ability to transform into an anaconda or an anaconda-human hybrid at will. This power is currently held by Boa Sandersonia, one of the Gorgon Sisters and a member of the Kuja tribe. The fruit's abilities provide enhanced physical strength, flexibility, and predatory instincts, making it a formidable tool in combat. The user can utilize the anaconda's natural traits, such as constriction and venomous bites, to overpower opponents. Additionally, the fruit's hybrid form combines the best attributes of both human and snake, offering versatility in various scenarios. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hebi Hebi no Mi's serpentine capabilities make it a powerful and dangerous Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hebi_hebi_model_anakonda.png"
    },
    {
        "originalName": "ヘビヘビの実 モデル 八岐大蛇",
        "romanizedName": "Hebi Hebi no Mi Moderu Yamata no Orochi",
        "englishName": "Snake-Snake Fruit, Model: Yamata-no-Orochi",
        "meaning": "Snake; Eight-Headed Snake",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "965",
        "debutEpisode": "965",
        "debutArc": "Wano",
        "currentHolder": "Unknown",
        "pastHolders": ["Kurozumi Orochi"],
        "description": "The Hebi Hebi no Mi, Model: Yamata-no-Orochi, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into the legendary eight-headed serpent, Yamata-no-Orochi, or a hybrid form at will. This power is currently held by Kurozumi Orochi, the former shogun of Wano. The fruit's abilities provide enhanced physical strength, durability, and the unique advantage of having multiple heads, each capable of independent action. This makes the user a formidable opponent in combat, capable of overwhelming enemies with sheer numbers and versatility. Additionally, the fruit's mythical nature suggests untapped potential, though its full capabilities remain unexplored. Despite its immense power, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hebi Hebi no Mi, Model: Yamata-no-Orochi, is a fearsome and iconic Devil Fruit in the Wano arc.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hebi_hebi_model_yamato_no_orochi.png"
    },
    {
        "originalName": "ヒエヒエの実",
        "romanizedName": "Hie Hie no Mi",
        "englishName": "Ice-Ice Fruit",
        "meaning": "Chilly",
        "type": "LOGIA",
        "debutChapter": "303",
        "debutEpisode": "225",
        "debutArc": "Water 7",
        "currentHolder": "Kuzan",
        "pastHolders": ["Kuzan"],
        "description": "The Hie Hie no Mi, also known as the Ice-Ice Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into ice. This power is currently held by Kuzan, formerly known as Admiral Aokiji of the Marines. The fruit's abilities allow the user to freeze vast areas instantly, immobilize opponents, and create ice-based structures for both offense and defense. Kuzan's mastery of the fruit has made him a formidable combatant, capable of altering the environment and overwhelming enemies with his freezing techniques. Despite its immense power, the fruit's effectiveness depends on the user's strategic use of ice and their ability to exploit its advantages in combat. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hie Hie no Mi's freezing capabilities make it a versatile and powerful Devil Fruit in the One Piece world.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hie_hie.png"
    },
    {
        "originalName": "ヒトヒトの実",
        "romanizedName": "Hito Hito no Mi",
        "englishName": "Human-Human Fruit",
        "meaning": "Human",
        "type": "ZOAN",
        "debutChapter": "138",
        "debutEpisode": "83",
        "debutArc": "Drum Island",
        "currentHolder": "Tony Tony Chopper",
        "pastHolders": ["Tony Tony Chopper"],
        "description": "The Hito Hito no Mi, also known as the Human-Human Fruit, is a Zoan-type Devil Fruit that grants its user the ability to transform into a human or a human hybrid at will. This power is currently held by Tony Tony Chopper, a reindeer and member of the Straw Hat Pirates. The fruit's abilities allow the user to gain human intelligence, speech, and physical capabilities, making it a unique and versatile tool. Chopper has further enhanced its potential through the use of Rumble Balls, which unlock additional transformations for combat and utility. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and mastery of its powers. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hito Hito no Mi's transformative capabilities make it a fascinating and essential part of Chopper's character and abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hito_hito.png"
    },
    {
        "originalName": "ヒトヒトの実 モデル“大仏”",
        "romanizedName": "Hito Hito no Mi, Moderu: Daibutsu",
        "englishName": "Human-Human Fruit, Model: Buddha",
        "meaning": "Human, Great Buddha",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "571",
        "debutEpisode": "480",
        "debutArc": "Marineford",
        "currentHolder": "Sengoku",
        "pastHolders": ["Sengoku"],
        "description": "The Hito Hito no Mi, Model: Buddha, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into a giant golden Buddha or a Buddha-human hybrid at will. This power is currently held by Sengoku, the former Fleet Admiral of the Marines. The fruit's abilities provide enhanced physical strength, durability, and the ability to emit powerful shockwaves, making it a formidable tool in combat. Sengoku's mastery of the fruit has allowed him to use its powers effectively in battle, showcasing its destructive potential. Despite its immense power, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hito Hito no Mi, Model: Buddha, is a unique and iconic Devil Fruit, symbolizing Sengoku's authority and strength within the Marines.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hito_hito_model_daibutsu.png"
    },
    {
        "originalName": "ホビホビの実",
        "romanizedName": "Hobi Hobi no Mi",
        "englishName": "Hobby-Hobby Fruit",
        "meaning": "Hobby",
        "type": "PARAMECIA",
        "debutChapter": "701",
        "debutEpisode": "630",
        "debutArc": "Dressrosa",
        "currentHolder": "Sugar",
        "pastHolders": ["Sugar"],
        "description": "The Hobi Hobi no Mi, also known as the Hobby-Hobby Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transform living beings into toys and erase their existence from the memories of others. This power is currently held by Sugar, a member of the Donquixote Pirates. The fruit's abilities allow the user to manipulate those transformed into toys, forcing them to obey their commands. This unique ability provides both offensive and defensive advantages, enabling the user to control the battlefield and manipulate opponents. However, the fruit's powers come with significant drawbacks, as the user must be cautious not to overuse them, as it can lead to unintended consequences. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Hobi Hobi no Mi's toy-manipulating capabilities make it a powerful and strategic tool in combat.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/hobi_hobi.png"
    },
    {
        "originalName": "ホロホロの実",
        "romanizedName": "Horo Horo no Mi",
        "englishName": "Hollow-Hollow Fruit",
        "meaning": "Hollow",
        "type": "PARAMECIA",
        "debutChapter": "442",
        "debutEpisode": "337",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Perona",
        "pastHolders": ["Perona"],
        "description": "The Horo Horo no Mi, also known as the Hollow-Hollow Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create and control ghosts. These ghosts can be used for various purposes, such as reconnaissance, emotional manipulation, or combat. The fruit's power is currently held by Perona, a former member of the Thriller Bark Pirates. The ghosts created by this fruit can pass through objects and people, causing emotional effects such as despair or fear. Additionally, the user can create explosive ghosts for offensive purposes. Despite its whimsical appearance, the fruit's abilities are highly versatile and can be used strategically in battle. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Horo Horo no Mi's ghostly capabilities make it a unique and intriguing addition to the world of Devil Fruits.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/horo_horo.png"
    },
    {
        "originalName": "イヌイヌの実 モデル「ダックスフント」",
        "romanizedName": "Inu Inu no Mi, Moderu: Dakkusufunto",
        "englishName": "Dog-Dog Fruit Model Dachshund ",
        "meaning": "Dog",
        "type": "ZOAN",
        "debutChapter": "184",
        "debutEpisode": "113",
        "debutArc": "Arabasta",
        "currentHolder": "Lassoo",
        "pastHolders": ["Lassoo"],
        "description": "The Inu Inu no Mi, Model: Dachshund, is a Zoan-type Devil Fruit that grants its user the ability to transform into a dachshund or a dachshund-human hybrid at will. This power is currently held by Lassoo, a gun that was turned into a living being through the use of the fruit. The fruit's abilities provide enhanced physical traits associated with dachshunds, such as agility and a keen sense of smell, making it a unique and unconventional tool in combat. Lassoo's use of the fruit showcases its potential for creative applications, as it combines the traits of a living being with the functionality of a weapon. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's ingenuity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Inu Inu no Mi, Model: Dachshund, is a fascinating and quirky Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/inu_inu.png"
    },
    {
        "originalName": "イヌイヌの実 モデル九尾の狐",
        "romanizedName": "Inu Inu no Mi Moderu Kyūbi no Kitsune",
        "englishName": "Dog-Dog Fruit, Model: Nine Tailed Fox",
        "meaning": "Dog; Nine-tailed fox",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "925",
        "debutEpisode": "917",
        "debutArc": "Wano",
        "currentHolder": "Catarina Devon",
        "pastHolders": ["Catarina Devon"],
        "description": "The Inu Inu no Mi, Model: Nine Tailed Fox, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into a nine-tailed fox or a hybrid form at will. This power is currently held by Catarina Devon, a member of the Blackbeard Pirates. The fruit's abilities provide enhanced physical strength, agility, and the unique ability to shapeshift into other people, making it a powerful tool for deception and combat. The user can utilize the fox's mythical traits to confuse enemies, infiltrate enemy lines, or launch surprise attacks. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Inu Inu no Mi, Model: Nine Tailed Fox, is a fascinating and versatile Devil Fruit, showcasing the creative potential of mythical Zoan abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/inu_inu_model_kyubi_no_kitsune.png"
    },
    {
        "originalName": "イヌイヌの実 モデル 大口真神",
        "romanizedName": "Inu Inu no Mi Moderu Ōkuchi no Makami",
        "englishName": "Dog-Dog Fruit, Model: Okuchi-no-Makami",
        "meaning": "Dog; Large-Mouthed True/Pure God",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "1070",
        "debutEpisode": "1041",
        "debutArc": "Wano",
        "currentHolder": "Yamato",
        "pastHolders": ["Yamato"],
        "description": "The Inu Inu no Mi, Model: Okuchi-no-Makami, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into the legendary wolf deity, Okuchi-no-Makami, or a hybrid form at will. This power is currently held by Yamato, the son of Kaido. The fruit's abilities provide enhanced physical strength, speed, and durability, as well as the ability to generate and manipulate ice, making it a formidable tool in combat. The fruit's mythical nature suggests untapped potential, though its full capabilities remain unexplored. Despite its immense power, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Inu Inu no Mi, Model: Okuchi-no-Makami, is a unique and iconic Devil Fruit, symbolizing Yamato's strength and connection to the Wano arc's themes of loyalty and freedom.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/inu_inu_model_okuchi_no_makami.png"
    },
    {
        "originalName": "イロイロの実",
        "romanizedName": "Iro Iro no Mi",
        "englishName": "Color-Color Fruit",
        "meaning": "Color",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Psycho",
        "pastHolders": ["Psycho"],
        "description": "The Iro Iro no Mi, also known as the Color-Color Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate and change the colors of objects and surroundings at will. This power is currently held by Psycho, a character from non-canon media. The fruit's abilities allow the user to create illusions, camouflage themselves, or alter the appearance of objects for strategic purposes. The user can also use the fruit's powers offensively by disorienting opponents or creating visual distractions. Despite its non-canon status, the Iro Iro no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of color manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to control colors makes it a versatile and unique tool, capable of surprising opponents and providing tactical advantages in various scenarios.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/iro_iro.png"
    },
    {
        "originalName": "イトイトの実",
        "romanizedName": "Ito Ito no Mi",
        "englishName": "tring-String Fruit",
        "meaning": "String; Thread",
        "type": "PARAMECIA",
        "debutChapter": "234",
        "debutEpisode": "151",
        "debutArc": "Jaya",
        "currentHolder": "Donquixote Doflamingo",
        "pastHolders": ["Donquixote Doflamingo"],
        "description": "The Ito Ito no Mi, also known as the String-String Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create and manipulate strings. This power is currently held by Donquixote Doflamingo, the former captain of the Donquixote Pirates. The fruit's abilities allow the user to control strings with incredible precision, enabling them to create weapons, control others like puppets, and even slice through objects. The strings are nearly invisible, making them difficult for opponents to detect. Additionally, the user can use the strings to attach themselves to clouds, allowing for flight. Doflamingo's mastery of the fruit has made him a formidable opponent, capable of overwhelming enemies with his strategic use of strings. Its awakening status has been revealed, allowing the user to transform the surrounding environment into strings, further enhancing its destructive potential. The Ito Ito no Mi is a versatile and dangerous Devil Fruit.",
        "awakeningStatus": true,
        "awakeningDescription": "The awakening of the Ito Ito no Mi allows the user to extend their string manipulation abilities to the environment, transforming nearby objects and terrain into strings. This drastically enhances the fruit's destructive potential and versatility, enabling large-scale attacks and battlefield control. The awakened strings retain their sharpness and durability, making them formidable weapons in combat. This advanced state of the fruit showcases the user's mastery and creativity, turning the surrounding area into a deadly extension of their power.",
        "isCanon": true,
        "imageUrl": "/images/ito_ito.png"
    },
    {
        "originalName": "ジャケジャケの実",
        "romanizedName": "Jake Jake no Mi",
        "englishName": "Jacket-Jacket Fruit",
        "meaning": "Jacket",
        "type": "PARAMECIA",
        "debutChapter": "715",
        "debutEpisode": "645",
        "debutArc": "Dressrosa",
        "currentHolder": "Kelly Funk",
        "pastHolders": ["Kelly Funk"],
        "description": "The Jake Jake no Mi, also known as the Jacket-Jacket Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transform into a jacket that can be worn by others. This power is currently held by Kelly Funk, a member of the Funk Brothers. The fruit's abilities allow the user to take control of the person wearing the jacket, effectively combining their strengths and skills. This unique ability provides both offensive and defensive advantages, enabling the user to enhance their combat capabilities by merging with a stronger ally. Despite its seemingly simple concept, the fruit's effectiveness depends on the user's strategy and the compatibility with their partner. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Jake Jake no Mi's ability to merge with others makes it a fascinating and unconventional Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/jake_jake.png"
    },
    {
        "originalName": "ジキジキの実",
        "romanizedName": "Jiki Jiki no Mi",
        "englishName": "Magnet-Magnet Fruit",
        "meaning": "Magnetism",
        "type": "PARAMECIA",
        "debutChapter": "504",
        "debutEpisode": "398",
        "debutArc": "Saobody Archipelago",
        "currentHolder": "Eustass Kid",
        "pastHolders": ["Eustass Kid"],
        "description": "The Jiki Jiki no Mi, also known as the Magnet-Magnet Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to generate and manipulate magnetic forces. This power is currently held by Eustass Kid, the captain of the Kid Pirates. The fruit's abilities allow the user to attract and repel metallic objects, enabling them to create powerful weapons, shields, or even massive constructs for combat. The user can also manipulate magnetic fields to control the movement of metal, providing both offensive and defensive advantages. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Jiki Jiki no Mi's magnetic capabilities make it a versatile and formidable tool in battle, capable of overwhelming opponents with sheer force and ingenuity.",
        "awakeningStatus": true,
        "awakeningDescription": "Once achieved, the user is capable of turning other objects, including living organisms, into magnets by assigning them with a specific polarity. This awakening has possible applications that do not rely on the user requiring metal from his surroundings, diminishing that specific weakness to an extent.",
        "isCanon": true,
        "imageUrl": "/images/jiki_jiki.png"
    },
    {
        "originalName": "カゲカゲの実",
        "romanizedName": "Kage Kage no Mi",
        "englishName": "Shadow-Shadow Fruit",
        "meaning": "Shadow",
        "type": "PARAMECIA",
        "debutChapter": "443",
        "debutEpisode": "338",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Gecko Moria",
        "pastHolders": ["Gecko Moria"],
        "description": "The Kage Kage no Mi, also known as the Shadow-Shadow Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to control shadows. This power is currently held by Gecko Moria, the former captain of the Thriller Bark Pirates. The fruit's abilities allow the user to manipulate their own shadow or the shadows of others, enabling them to create shadow-based constructs, steal shadows to empower themselves, or even animate lifeless objects by imbuing them with shadows. The stolen shadows can grant enhanced strength and abilities to the user or their creations. However, the fruit's powers come with limitations, such as the vulnerability of shadowless individuals to sunlight. Despite its eerie nature, the Kage Kage no Mi is a versatile and strategic tool in combat. Its awakening status remains unknown, and it has not been shown to have any previous holders. The fruit's shadow manipulation makes it a unique and formidable Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/kage_kage.png"
    },
    {
        "originalName": "キラキラの実",
        "romanizedName": "Kira Kira no Mi",
        "englishName": "Twinkle-Twinkle Fruit",
        "meaning": "Sparkle",
        "type": "PARAMECIA",
        "debutChapter": "553",
        "debutEpisode": "463",
        "debutArc": "Marineford",
        "currentHolder": "Jozu",
        "pastHolders": ["Jozu"],
        "description": "The Kira Kira no Mi, also known as the Twinkle-Twinkle Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transform parts of their body into diamond. This power is currently held by Jozu, a commander of the Whitebeard Pirates. The fruit's abilities provide immense defensive capabilities, as the diamond transformation makes the user nearly impervious to physical attacks. Additionally, the user can use their diamond-enhanced body offensively, delivering devastating blows with incredible force. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Kira Kira no Mi's diamond-based abilities make it a powerful and resilient Devil Fruit, capable of withstanding even the most formidable attacks while delivering crushing counterattacks.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/kira_kira.png"
    },
    {
        "originalName": "キロキロの実",
        "romanizedName": "Kiro Kiro no Mi",
        "englishName": "Kilo-Kilo Fruit",
        "meaning": "Kilo from Kilogram",
        "type": "PARAMECIA",
        "debutChapter": "112",
        "debutEpisode": "66",
        "debutArc": "Whisky Peak",
        "currentHolder": "Mikita",
        "pastHolders": ["Mikita"],
        "description": "The Kiro Kiro no Mi, also known as the Kilo-Kilo Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate their body weight from 1 kilogram to 10,000 kilograms. This power is currently held by Mikita, also known as Miss Valentine, a former officer agent of Baroque Works. The fruit's abilities allow the user to adjust their weight at will, providing both offensive and defensive advantages. For example, the user can increase their weight to deliver devastating attacks or decrease it to float and evade enemies. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Kiro Kiro no Mi's weight manipulation capabilities make it a versatile and strategic tool in battle, capable of surprising opponents with its dynamic applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/kiro_kiro.png"
    },
    {
        "originalName": "キャラキャラの実",
        "romanizedName": "Kyara Kyara no Mi",
        "englishName": "Merge-Merge Fruit",
        "meaning": "Character",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Lip Shark",
        "pastHolders": ["Lip Shark"],
        "description": "The Kyara Kyara no Mi, also known as the Merge-Merge Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to merge objects or entities into a single cohesive form. This power is currently held by Lip Shark, a character from non-canon media. The fruit's abilities allow the user to combine the properties of merged items, creating unique and versatile constructs for both offensive and defensive purposes. The user can also merge living beings, though the ethical implications and limitations of this ability remain unclear. Despite its non-canon status, the Kyara Kyara no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of merging abilities. Its awakening status remains unknown, and no previous holders have been documented. The fruit's merging capabilities make it a versatile and strategic tool, capable of surprising opponents with its innovative applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/kyara_kyara.png"
    },
    {
        "originalName": "マグマグの実",
        "romanizedName": "Magu Magu no Mi",
        "englishName": "Mag-Mag Fruit",
        "meaning": "Magma",
        "type": "LOGIA",
        "debutChapter": "554",
        "debutEpisode": "463",
        "debutArc": "Marineford",
        "currentHolder": "Sakazuki Akainu",
        "pastHolders": ["Sakazuki Akainu"],
        "description": "The Magu Magu no Mi, also known as the Mag-Mag Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into magma. This power is currently held by Sakazuki, also known as Akainu, the Fleet Admiral of the Marines. The fruit's abilities allow the user to unleash devastating magma-based attacks, capable of incinerating anything in their path. The intense heat and destructive power of magma make this fruit one of the most fearsome in existence. Akainu's mastery of the fruit has made him a formidable opponent, capable of overwhelming enemies with sheer force and precision. Despite its immense power, the fruit's effectiveness depends on the user's strategic use of magma and their ability to exploit its advantages in combat. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Magu Magu no Mi's magma capabilities make it a devastating weapon in battle.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/magu_magu.png"
    },
    {
        "originalName": "マネマネの実",
        "romanizedName": "Mane Mane no Mi",
        "englishName": "Clone-Clone Fruit",
        "meaning": "Imitation",
        "type": "PARAMECIA",
        "debutChapter": "156",
        "debutEpisode": "92",
        "debutArc": "Whisky Peak",
        "currentHolder": "Bentham",
        "pastHolders": ["Bentham","Kurozumi Higurashi"],
        "description": "The Mane Mane no Mi, also known as the Clone-Clone Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transform into a perfect copy of anyone they touch. This power is currently held by Bentham, also known as Mr. 2 Bon Clay, a former officer agent of Baroque Works. The fruit's abilities allow the user to mimic not only the appearance but also the voice of the copied individual, making it a powerful tool for infiltration and deception. The user can switch between forms at will, providing versatility in various scenarios. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has been shown to have a previous holder, Kurozumi Higurashi. The Mane Mane no Mi's mimicry capabilities make it a unique and strategic Devil Fruit in the One Piece world.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/mane_mane.png"
    },
    {
        "originalName": "メラメラの実",
        "romanizedName": "Mera Mera no Mi",
        "englishName": "Flame-Flame Fruit",
        "meaning": "Sound of fire burning",
        "type": "LOGIA",
        "debutChapter": "158",
        "debutEpisode": "94",
        "debutArc": "Arabasta",
        "currentHolder": "Sabo",
        "pastHolders": ["Sabo","Portgas D. Ace"],
        "description": "The Mera Mera no Mi, also known as the Flame-Flame Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into fire. This power is currently held by Sabo, the Chief of Staff of the Revolutionary Army, who inherited it after the death of its previous user, Portgas D. Ace. The fruit's abilities allow the user to unleash devastating fire-based attacks, providing both offensive and defensive advantages in combat. The user can generate intense flames to incinerate enemies, create barriers of fire, or enhance their physical attacks with fiery power. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any additional previous holders. The Mera Mera no Mi's fiery capabilities make it one of the most iconic and powerful Devil Fruits in existence.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/mera_mera.png"
    },
    {
        "originalName": "メロメロの実",
        "romanizedName": "Mero Mero no Mi",
        "englishName": "Love-Love Fruit",
        "meaning": "Fall in Love",
        "type": "PARAMECIA",
        "debutChapter": "516",
        "debutEpisode": "410",
        "debutArc": "Amazon Lily",
        "currentHolder": "Boa Hancock",
        "pastHolders": ["Boa Hancock"],
        "description": "The Mero Mero no Mi, also known as the Love-Love Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to turn others into stone through the power of love and attraction. This power is currently held by Boa Hancock, the Pirate Empress and captain of the Kuja Pirates. The fruit's abilities allow the user to petrify anyone who harbors feelings of lust or admiration towards them, making it a powerful tool in combat and manipulation. The user can also create heart-shaped projectiles that induce petrification upon contact. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's charisma and ability to exploit their opponents' emotions. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Mero Mero no Mi's unique ability to weaponize affection makes it a fascinating and strategic Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/mero_mero.png"
    },
    {
        "originalName": "ミニミニの実",
        "romanizedName": "Mini Mini no Mi",
        "englishName": "Mini-Mini Fruit",
        "meaning": "Miniature",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Lily Enstomach",
        "pastHolders": ["Lily Enstomach"],
        "description": "The Mini Mini no Mi, also known as the Mini-Mini Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to shrink themselves to a miniature size at will. This power is currently held by Lily Enstomach, a character from non-canon media. The fruit's abilities allow the user to navigate tight spaces, evade attacks, and perform reconnaissance with ease. Additionally, the user can use their small size to surprise opponents or access areas that would otherwise be inaccessible. Despite its non-canon status, the Mini Mini no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of size manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to shrink the user makes it a versatile and strategic tool, capable of providing unique advantages in various scenarios.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/mini_mini.png"
    },
    {
        "originalName": "モチモチの実",
        "romanizedName": "Mochi Mochi no Mi",
        "englishName": "Mochi-Mochi Fruit",
        "meaning": "Mochi; Springy",
        "type": "PARAMECIA",
        "debutChapter": "863",
        "debutEpisode": "833",
        "debutArc": "Whole Cake Island",
        "currentHolder": "Charlotte Katakuri",
        "pastHolders": ["Charlotte Katakuri"],
        "description": "The Mochi Mochi no Mi, also known as the Mochi-Mochi Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create, control, and transform into mochi, a sticky and elastic substance. This power is currently held by Charlotte Katakuri, one of the Sweet Commanders of the Big Mom Pirates. The fruit's abilities allow the user to manipulate mochi for both offensive and defensive purposes, creating weapons, traps, or barriers. Katakuri's mastery of the fruit, combined with his advanced Observation Haki, makes him a formidable opponent. The fruit's awakening allows the user to transform the surrounding environment into mochi, further enhancing its versatility and destructive potential. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and combat skills. The Mochi Mochi no Mi's unique properties make it a powerful and strategic tool in battle.",
        "awakeningStatus": true,
        "awakeningDescription": "The awakening of the Mochi Mochi no Mi allows the user to transform the surrounding environment into mochi, drastically enhancing their combat capabilities. This ability provides the user with greater control over the battlefield, enabling large-scale attacks and defensive maneuvers. The awakened mochi retains its sticky and elastic properties, making it a versatile tool for trapping opponents or creating powerful constructs. This advanced state showcases the user's mastery and creativity, turning the environment into an extension of their power.",
        "isCanon": true,
        "imageUrl": "/images/mochi_mochi.png"
    },
    {
        "originalName": "モクモクの実",
        "romanizedName": "Moku Moku no Mi",
        "englishName": "Smoke-Smoke Fruit",
        "meaning": "Sound of billowing smoke",
        "type": "LOGIA",
        "debutChapter": "100",
        "debutEpisode": "48",
        "debutArc": "Loguetown",
        "currentHolder": "Smoker",
        "pastHolders": ["Smoker"],
        "description": "The Moku Moku no Mi, also known as the Smoke-Smoke Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into smoke. This power is currently held by Smoker, a Marine Vice Admiral. The fruit's abilities allow the user to manipulate smoke for both offensive and defensive purposes, such as creating smoke-based attacks, restraining opponents, or evading attacks by transforming into smoke. The user can also control the density of the smoke, making it tangible or intangible as needed. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's creativity and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Moku Moku no Mi's smoke-based capabilities make it a versatile and strategic tool in battle, capable of overwhelming opponents with its dynamic applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/moku_moku.png"
    },
    {
        "originalName": "モリモリの実",
        "romanizedName": "Mori Mori no Mi",
        "englishName": "Woods-Woods Fruit",
        "meaning": "Forest",
        "type": "LOGIA",
        "debutChapter": "1052",
        "debutEpisode": "1079",
        "debutArc": "Wano",
        "currentHolder": "Aramaki",
        "pastHolders": ["Aramaki"],
        "description": "The Mori Mori no Mi, also known as the Woods-Woods Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into forests. This power is currently held by Aramaki, also known as Admiral Ryokugyu of the Marines. The fruit's abilities allow the user to manipulate plant life on a massive scale, creating forests, vines, and roots for both offensive and defensive purposes. The user can also absorb nutrients from others to enhance their strength, showcasing the fruit's versatility in combat. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Mori Mori no Mi's forest-based capabilities make it a powerful and strategic tool, capable of overwhelming opponents and reshaping the battlefield.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/mori_mori.png"
    },
    {
        "originalName": "ネコネコの実 モデル“豹レオパルド”",
        "romanizedName": "Neko Neko no Mi, Moderu: Reoparudo",
        "englishName": "Cat-Cat Fruit, Model: Leopard",
        "meaning": "Cat",
        "type": "ZOAN",
        "debutChapter": "348",
        "debutEpisode": "245",
        "debutArc": "Enies Lobby",
        "currentHolder": "Rob Lucci",
        "pastHolders": ["Rob Lucci"],
        "description": "The Neko Neko no Mi, Model: Leopard, is a Zoan-type Devil Fruit that grants its user the ability to transform into a leopard or a leopard-human hybrid at will. This power is currently held by Rob Lucci, a member of CP0 and former CP9 agent. The fruit's abilities provide enhanced physical strength, speed, and agility, making it a formidable tool in combat. The user can utilize the leopard's natural predatory traits, such as sharp claws and fangs, to overpower opponents. Additionally, the fruit's hybrid form combines the best attributes of both human and leopard, offering versatility in various scenarios. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Neko Neko no Mi, Model: Leopard, is a powerful and iconic Devil Fruit in the One Piece world.",
        "awakeningStatus": true,
        "awakeningDescription": "Upon awakening, the user's Human-Beast form undergoes a physical transformation where their size increases, their body becomes more slender and muscular to increase power, fangs, a dark flame forms a mane down the user's back and arms, and a stream of floating fire wraps around the user's shoulders.",
        "isCanon": true,
        "imageUrl": "/images/neko_neko_model_leopard.png"
    },
    {
        "originalName": "ニキュニキュの実",
        "romanizedName": "Nikyu Nikyu no Mi",
        "englishName": "Paw-Paw Fruit",
        "meaning": "Paw",
        "type": "PARAMECIA",
        "debutChapter": "473",
        "debutEpisode": "368",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Bartholomew Kuma",
        "pastHolders": ["Bartholomew Kuma"],
        "description": "The Nikyu Nikyu no Mi, also known as the Paw-Paw Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to repel anything they touch, including physical objects, attacks, and even intangible concepts like pain or fatigue. This power is currently held by Bartholomew Kuma, a former Warlord of the Sea and revolutionary. The fruit's abilities allow the user to deflect attacks, launch devastating shockwaves, and even transport people or objects across vast distances. The user can also remove pain or exhaustion from others and transfer it elsewhere, showcasing the fruit's versatility in both combat and support scenarios. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its powers. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Nikyu Nikyu no Mi's repelling capabilities make it a unique and powerful Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/nikyu_nikyu.png"
    },
    {
        "originalName": "ノミノミの実",
        "romanizedName": "Nomi Nomi no Mi",
        "englishName": "Brain-Brain Fruit",
        "meaning": "Brains",
        "type": "PARAMECIA",
        "debutChapter": "1066",
        "debutEpisode": "1096",
        "debutArc": "EggHead",
        "currentHolder": "Vegapunk",
        "pastHolders": ["Vegapunk"],
        "description": "The Nomi Nomi no Mi, also known as the Brain-Brain Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to store and process an infinite amount of knowledge. This power is currently held by Vegapunk, the world-renowned scientist. The fruit's abilities allow the user to expand their brain's capacity indefinitely, enabling them to retain vast amounts of information and perform complex calculations with ease. This unique ability has made Vegapunk a pivotal figure in the world of science and technology, driving numerous advancements. Despite its immense potential, the fruit's effectiveness depends on the user's ability to manage and utilize the accumulated knowledge strategically. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Nomi Nomi no Mi's knowledge-enhancing capabilities make it a fascinating and invaluable tool, symbolizing the pursuit of intellectual growth and innovation.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/nomi_nomi.png"
    },
    {
        "originalName": "ヌイヌイの実",
        "romanizedName": "Nui Nui no Mi",
        "englishName": "Sew-Sew Fruit",
        "meaning": "Sewing",
        "type": "PARAMECIA",
        "debutChapter": "711",
        "debutEpisode": "641",
        "debutArc": "Dressrosa",
        "currentHolder": "Leo",
        "pastHolders": ["Leo"],
        "description": "The Nui Nui no Mi, also known as the Sew-Sew Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to stitch and sew objects together, regardless of their material. This power is currently held by Leo, a member of the Tontatta Tribe and the Straw Hat Grand Fleet. The fruit's abilities allow the user to sew objects or even living beings together, creating unique and strategic advantages in combat or utility scenarios. The user can manipulate threads to bind enemies, repair damaged items, or create intricate constructs. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and mastery of its powers. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Nui Nui no Mi's sewing capabilities make it a versatile and resourceful tool, capable of surprising opponents with its innovative applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/nui_nui.png"
    },
    {
        "originalName": "ヌマヌマの実",
        "romanizedName": "Numa Numa no Mi",
        "englishName": "Swamp-Swamp Fruit",
        "meaning": "Swamp",
        "type": "LOGIA",
        "debutChapter": "603",
        "debutEpisode": "521",
        "debutArc": "Fishman Island",
        "currentHolder": "Caribou",
        "pastHolders": ["Caribou"],
        "description": "The Numa Numa no Mi, also known as the Swamp-Swamp Fruit, is a Logia-type Devil Fruit that grants its user the ability to transform into, create, and control swamp-like substances. This power is currently held by Caribou, a notorious pirate. The fruit's abilities allow the user to engulf objects or people into their swamp body, effectively trapping them. The user can also store items within their swamp, making it a useful tool for smuggling or combat. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Numa Numa no Mi's swamp-based capabilities make it a versatile and resourceful Devil Fruit, capable of overwhelming opponents with its unique trapping and storage abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/numa_numa.png"
    },
    {
        "originalName": "オペオペの実",
        "romanizedName": "Ope Ope no Mi",
        "englishName": "Op-Op Fruit",
        "meaning": "Operation",
        "type": "PARAMECIA",
        "debutChapter": "504",
        "debutEpisode": "398",
        "debutArc": "Saobody Archipelago",
        "currentHolder": "Tralfalgar D. Water Law",
        "pastHolders": ["Tralfalgar D. Water Law"],
        "description": "The Ope Ope no Mi, also known as the Op-Op Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create a spherical operating room, known as a 'ROOM,' within which they can manipulate the spatial arrangement of objects and people. This power is currently held by Trafalgar D. Water Law, the captain of the Heart Pirates. The fruit's abilities allow the user to perform various feats, such as teleportation, dismemberment without harm, and even swapping personalities. Additionally, the fruit is rumored to grant eternal youth through a secretive procedure, though at the cost of the user's life. Despite its immense potential, the fruit's effectiveness depends on the user's skill and creativity. Its awakening status has been revealed, allowing the user to extend their ROOM's influence to manipulate objects on a larger scale. The Ope Ope no Mi is a versatile and highly coveted Devil Fruit.",
        "awakeningStatus": true,
        "awakeningDescription": "Once this fruit is awakened, the user gains the ability to create special ROOMs that adhere directly to foreign objects or living beings instead of surrounding a specific space around the user, not requiring their presence within the operating field for techniques to be performed (unlike normal ROOMs, where the user needs to be inside at all times).[19] This directly addresses one of the fruit's biggest weaknesses, which is the stationary nature of its normal field of range.",
        "isCanon": true,
        "imageUrl": "/images/ope_ope.png"
    },
    {
        "originalName": "パサパサの実",
        "romanizedName": "Pasa Pasa no Mi",
        "englishName": "Paper-Paper Fruit",
        "meaning": "Paper",
        "type": "LOGIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Simon",
        "pastHolders": ["Simon"],
        "description": "The Pasa Pasa no Mi, also known as the Paper-Paper Fruit, is a Logia-type Devil Fruit that grants its user the ability to transform into, create, and control paper. This power is currently held by Simon, a character from non-canon media. The fruit's abilities allow the user to manipulate paper for various purposes, such as creating sharp paper-based weapons, forming defensive barriers, or disguising themselves by blending into their surroundings. The user can also create origami constructs that can be used for reconnaissance or combat. Despite its non-canon status, the Pasa Pasa no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of paper manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to control paper makes it a versatile and strategic tool, capable of surprising opponents with its innovative applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/pasa_pasa.png"
    },
    {
        "originalName": "ぺケぺケの実",
        "romanizedName": "Peke Peke no Mi",
        "englishName": "Peketan-Peketan Fruit",
        "meaning": "Peketan",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Peketan",
        "pastHolders": ["Peketan"],
        "description": "The the Peketan-Peketan Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to create clones of Pekean. This power is currently held by Peketan, a character from non-canon media.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/peke_peke.png"
    },
    {
        "originalName": "ピカピカの実",
        "romanizedName": "Pika Pika no Mi",
        "englishName": "Glint-Glint Fruit",
        "meaning": "Glimmer or Light",
        "type": "LOGIA",
        "debutChapter": "506",
        "debutEpisode": "400",
        "debutArc": "Saobody Archipelago",
        "currentHolder": "Borsalino Kizaru",
        "pastHolders": ["Borsalino Kizaru"],
        "description": "The Pika Pika no Mi, also known as the Glint-Glint Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into light. This power is currently held by Borsalino, also known as Admiral Kizaru of the Marines. The fruit's abilities allow the user to move at the speed of light, unleash devastating light-based attacks, and manipulate light for various purposes, such as creating blinding flashes or precise laser beams. Kizaru's mastery of the fruit has made him a formidable opponent, capable of overwhelming enemies with his speed and destructive power. Despite its immense potential, the fruit's effectiveness depends on the user's strategic thinking and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Pika Pika no Mi's light-based capabilities make it one of the most powerful and iconic Devil Fruits in existence.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/pika_pika.png"
    },
    {
        "originalName": "ラキラキの実",
        "romanizedName": "Raki Raki no Mi",
        "englishName": "Lucky-Lucky Fruit",
        "meaning": "Lucky",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Baccarat",
        "pastHolders": ["Baccarat"],
        "description": "The Raki Raki no Mi, also known as the Lucky-Lucky Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate luck. This power is currently held by Baccarat, a character from non-canon media. The fruit's abilities allow the user to influence probabilities, ensuring favorable outcomes for themselves or misfortune for others. This unique ability provides both offensive and defensive advantages, enabling the user to manipulate events in their favor during combat or other scenarios. Despite its non-canon status, the Raki Raki no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of luck manipulation. Its awakening status remains unknown, and no previous holders have been documented. The fruit's ability to control luck makes it a versatile and strategic tool, capable of surprising opponents and providing significant advantages in various situations.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/raki_raki.png"
    },
    {
        "originalName": "リュウリュウの実 モデル アロサウルス",
        "romanizedName": "Ryū Ryū no Mi Moderu Arosaurusu",
        "englishName": "Dragon-Dragon Fruit, Allosaurus Model",
        "meaning": "Dragon, Dinosaur",
        "type": "ANCIENT_ZOAN",
        "debutChapter": "509",
        "debutEpisode": "402",
        "debutArc": "Saobody Archipelago",
        "currentHolder": "X Drake",
        "pastHolders": ["X Drake"],
        "description": "The Ryū Ryū no Mi, Model: Allosaurus, is an Ancient Zoan-type Devil Fruit that grants its user the ability to transform into an Allosaurus or an Allosaurus-human hybrid at will. This power is currently held by X Drake, a former Marine Rear Admiral turned pirate and member of the Worst Generation. The fruit's abilities provide enhanced physical strength, durability, and predatory instincts, making it a formidable tool in combat. The user can utilize the Allosaurus's natural traits, such as powerful jaws and claws, to overpower opponents. Additionally, the fruit's hybrid form combines the best attributes of both human and dinosaur, offering versatility in various scenarios. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Ryū Ryū no Mi, Model: Allosaurus, is a powerful and iconic Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/ryu_ryu_model_allosaurus.png"
    },
    {
        "originalName": "サラサラの実 モデルアホロートル",
        "romanizedName": "Sara Sara no Mi: Moderu Ahorōtoru",
        "englishName": "Sala-Sala Fruit, Model: Axolotl",
        "meaning": "Salamander",
        "type": "ZOAN",
        "debutChapter": "602",
        "debutEpisode": "594",
        "debutArc": "Punk Hazard",
        "currentHolder": "Unknown",
        "pastHolders": ["Smiley"],
        "description": "The Sara Sara no Mi, Model: Axolotl, is a Zoan-type Devil Fruit that grants its user the ability to transform into an axolotl or an axolotl-human hybrid at will. This power was previously held by Smiley, a gelatinous creature created by Caesar Clown. The fruit's abilities provide enhanced physical traits associated with axolotls, such as regeneration and aquatic adaptability, making it a unique and versatile tool in combat and survival scenarios. The user can utilize the axolotl's natural traits to navigate underwater environments or recover from injuries more effectively. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any additional previous holders. The Sara Sara no Mi, Model: Axolotl, is a fascinating and unconventional Devil Fruit, showcasing the potential of aquatic Zoan abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/sara_sara_model_axolotl.png"
    },
    {
        "originalName": "シマシマの実",
        "romanizedName": "Shima Shima no Mi",
        "englishName": "Isle-Isle Fruit",
        "meaning": "Island",
        "type": "PARAMECIA",
        "debutChapter": "1080",
        "debutEpisode": "1113",
        "debutArc": "EggHead",
        "currentHolder": "Avalo Pizarro",
        "pastHolders": ["Avalo Pizarro"],
        "description": "The Shima Shima no Mi, also known as the Isle-Isle Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to merge with and control entire islands. This power is currently held by Avalo Pizarro, a member of the Blackbeard Pirates. The fruit's abilities allow the user to manipulate the terrain, structures, and natural features of an island, providing both offensive and defensive advantages. The user can reshape the environment to create barriers, traps, or weapons, showcasing the fruit's immense potential for large-scale combat and strategic dominance. Despite its immense power, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Shima Shima no Mi's island-manipulating capabilities make it a unique and formidable Devil Fruit, capable of reshaping the battlefield entirely.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/shima_shima.png"
    },
    {
        "originalName": "SMILEスマイル; 人造悪魔の実",
        "romanizedName": "Sumairu",
        "englishName": "SMILE",
        "meaning": "SMILE",
        "type": "ZOAN",
        "debutChapter": "615",
        "debutEpisode": "689",
        "debutArc": "Punk Hazard",
        "currentHolder": "Gifters",
        "pastHolders": ["Gifters"],
        "description": "SMILE fruits are artificial Devil Fruits created by Caesar Clown and Donquixote Doflamingo, designed to grant Zoan-like abilities to their users. Unlike natural Zoan fruits, SMILE fruits have a significant drawback: only a portion of users gain animal traits and abilities, while others suffer permanent side effects, such as uncontrollable laughter. These fruits are mass-produced using SAD, a chemical substance, and are distributed to create an army of Gifters for the Beast Pirates. SMILE fruits are notable for their unpredictability and the inability to swim, a common trait shared with natural Devil Fruits. Despite their flaws, they have been instrumental in Kaido's rise to power, providing him with a formidable force of enhanced warriors. However, their artificial nature and the suffering they cause have made them a controversial and tragic element in the One Piece world.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/smile_smile.png"
    },
    {
        "originalName": "ソルソルの実",
        "romanizedName": "Soru Soru no Mi",
        "englishName": "Soul-Soul Fruit",
        "meaning": "Soul",
        "type": "PARAMECIA",
        "debutChapter": "651",
        "debutEpisode": "571",
        "debutArc": "Fishman Island",
        "currentHolder": "Charlotte Linlin",
        "pastHolders": ["Charlotte Linlin"],
        "description": "The Soru Soru no Mi, also known as the Soul-Soul Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate souls. This power is currently held by Charlotte Linlin, also known as Big Mom, one of the Four Emperors. The fruit's abilities allow the user to extract fragments of souls from others, imbuing them into objects or animals to create sentient beings called Homies. These Homies serve the user and can be used for various purposes, such as combat, reconnaissance, or utility. The fruit's powers also enable the user to manipulate the lifespan of others, making it a fearsome tool for domination. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Soru Soru no Mi's soul-manipulating capabilities make it a unique and powerful Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/soru_soru.png"
    },
    {
        "originalName": "スベスベの実",
        "romanizedName": "Sube Sube no Mi",
        "englishName": "Smooth-Smooth Fruit",
        "meaning": "Smooth",
        "type": "PARAMECIA",
        "debutChapter": "51",
        "debutEpisode": "46",
        "debutArc": "Loguetown",
        "currentHolder": "Alvida",
        "pastHolders": ["Alvida"],
        "description": "The Sube Sube no Mi, also known as the Smooth-Smooth Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to make their body extremely smooth and slippery. This power is currently held by Alvida, a former pirate captain turned ally of Buggy. The fruit's abilities allow the user to deflect physical attacks and projectiles by causing them to slide off their body, providing both offensive and defensive advantages. Additionally, the fruit enhances the user's physical appearance, making them more attractive. Despite its seemingly simple nature, the fruit's effectiveness depends on the user's creativity and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Sube Sube no Mi's smoothness-based capabilities make it a unique and intriguing Devil Fruit, capable of surprising opponents with its unconventional applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/sube_sube.png"
    },
    {
        "originalName": "スケスケの実",
        "romanizedName": "Suke Suke no Mi",
        "englishName": "Clear-Clear Fruit",
        "meaning": "See-through; Sheer",
        "type": "PARAMECIA",
        "debutChapter": "444",
        "debutEpisode": "339",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Shiryu",
        "pastHolders": ["Shiryu","Absalom"],
        "description": "The Suke Suke no Mi, also known as the Clear-Clear Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to turn themselves and anything they touch invisible. This power is currently held by Shiryu, a member of the Blackbeard Pirates, who acquired it after the death of its previous user, Absalom. The fruit's abilities provide significant advantages in stealth and combat, allowing the user to evade detection, launch surprise attacks, or infiltrate enemy territory. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's creativity and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any additional previous holders. The Suke Suke no Mi's invisibility capabilities make it a unique and versatile Devil Fruit, capable of turning the tide of battle through cunning and surprise.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/suke_suke.png"
    },
    {
        "originalName": "スナスナの実",
        "romanizedName": "Suna Suna no Mi",
        "englishName": "Sand-Sand Fruit",
        "meaning": "Sand",
        "type": "LOGIA",
        "debutChapter": "127",
        "debutEpisode": "77",
        "debutArc": "Whisky Peak",
        "currentHolder": "Crocodile",
        "pastHolders": ["Crocodile"],
        "description": "The Suna Suna no Mi, also known as the Sand-Sand Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into sand. This power is currently held by Crocodile, the former president of Baroque Works. The fruit's abilities allow the user to manipulate sand for both offensive and defensive purposes, such as creating sandstorms, quicksand, or sharp sand-based weapons. The user can also dehydrate objects or living beings by absorbing moisture, showcasing the fruit's destructive potential. Despite its immense power, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Suna Suna no Mi's sand-based capabilities make it a versatile and formidable Devil Fruit, capable of overwhelming opponents and reshaping the battlefield with its dynamic applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/suna_suna.png"
    },
    {
        "originalName": "スパスパの実",
        "romanizedName": "Supa Supa no Mi",
        "englishName": "Dice-Dice Fruit",
        "meaning": "Sound of cutting",
        "type": "PARAMECIA",
        "debutChapter": "160",
        "debutEpisode": "103",
        "debutArc": "Arabasta",
        "currentHolder": "Daz Bonez",
        "pastHolders": ["Daz Bonez"],
        "description": "The Supa Supa no Mi, also known as the Dice-Dice Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transform parts of their body into blades. This power is currently held by Daz Bonez, also known as Mr. 1, a former officer agent of Baroque Works. The fruit's abilities allow the user to create razor-sharp blades from any part of their body, providing both offensive and defensive advantages. The user can use these blades to deliver powerful slashes, block attacks, or enhance their physical combat capabilities. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Supa Supa no Mi's blade-based capabilities make it a versatile and formidable Devil Fruit, capable of overwhelming opponents with its cutting-edge abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/supa_supa.png"
    },
    {
        "originalName": "タマタマの実",
        "romanizedName": "Tama Tama no Mi",
        "englishName": "Egg-Egg Fruit",
        "meaning": "Egg",
        "type": "ZOAN",
        "debutChapter": "850",
        "debutEpisode": "816",
        "debutArc": "Whole Cake Island",
        "currentHolder": "Tamago",
        "pastHolders": ["Tamago"],
        "description": "The Tama Tama no Mi, also known as the Egg-Egg Fruit, is a Zoan-type Devil Fruit that grants its user the ability to transform into an egg and undergo various stages of evolution. This power is currently held by Tamago, a member of the Big Mom Pirates. The fruit's abilities allow the user to regenerate and evolve into stronger forms after being defeated, providing both offensive and defensive advantages. Each transformation enhances the user's combat capabilities, making them increasingly formidable. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's strategic use of its regenerative and evolutionary properties. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Tama Tama no Mi's unique evolutionary capabilities make it a fascinating and unconventional Devil Fruit, capable of surprising opponents with its dynamic transformations.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/tama_tama.png"
    },
    {
        "originalName": "トゲトゲの実",
        "romanizedName": "Toge Toge no Mi",
        "englishName": "Spike-Spike Fruit",
        "meaning": "Spike; Thorn",
        "type": "PARAMECIA",
        "debutChapter": "190",
        "debutEpisode": "117",
        "debutArc": "Arabasta",
        "currentHolder": "Zala",
        "pastHolders": ["Zala"],
        "description": "The Toge Toge no Mi, also known as the Spike-Spike Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to grow sharp spikes from their body. This power is currently held by Zala, also known as Miss Doublefinger, a former officer agent of Baroque Works. The fruit's abilities allow the user to create spikes for both offensive and defensive purposes, such as launching piercing attacks or forming protective barriers. The user can also enhance their physical combat capabilities by incorporating spikes into their strikes. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's creativity and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Toge Toge no Mi's spike-based capabilities make it a versatile and strategic tool in battle, capable of overwhelming opponents with its sharp and dynamic applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/toge_toge.png"
    },
    {
        "originalName": "トリトリの実 モデル 不死鳥フェニックス",
        "romanizedName": "Tori Tori no Mi Moderu Fenikkusu",
        "englishName": "Bird-Bird Fruit, Model: Phoenix",
        "meaning": "Bird; Phoenix",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "553",
        "debutEpisode": "463",
        "debutArc": "Marineford",
        "currentHolder": "Marco",
        "pastHolders": ["Marco"],
        "description": "The Tori Tori no Mi, Model: Phoenix, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into a phoenix or a phoenix-human hybrid at will. This power is currently held by Marco, the former first division commander of the Whitebeard Pirates. The fruit's abilities provide enhanced physical strength, flight, and the unique ability to heal injuries through blue phoenix flames, which do not burn but regenerate. This makes the user nearly invincible in combat, as they can recover from most attacks. The fruit's mythical nature suggests untapped potential, though its full capabilities remain unexplored. Despite its immense power, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Tori Tori no Mi, Model: Phoenix, is a powerful and iconic Devil Fruit in the One Piece world.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/tori_tori_model_phoenix.png"
    },
    {
        "originalName": "ウオウオの実 モデル 青龍",
        "romanizedName": "Uo Uo no Mi Moderu Seiryū",
        "englishName": "Fish-Fish Fruit, Model: Azure Dragon",
        "meaning": "Fish, Azure Dragon",
        "type": "MYTHICAL_ZOAN",
        "debutChapter": "921",
        "debutEpisode": "912",
        "debutArc": "Wano",
        "currentHolder": "Kaidou",
        "pastHolders": ["Kaidou"],
        "description": "The Uo Uo no Mi, Model: Azure Dragon, is a Mythical Zoan-type Devil Fruit that grants its user the ability to transform into an Azure Dragon or a dragon-human hybrid at will. This power is currently held by Kaidou, one of the Four Emperors and the former Governor-General of the Beast Pirates. The fruit's abilities provide immense physical strength, durability, and the power to generate and manipulate elemental attacks, such as fire and lightning. The user can also achieve flight and create devastating shockwaves, making it a formidable tool in combat. The fruit's mythical nature suggests untapped potential, though its full capabilities remain unexplored. Despite its immense power, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Uo Uo no Mi, Model: Azure Dragon, is a legendary and iconic Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/uo_uo_model_seiryu.png"
    },
    {
        "originalName": "ウシウシの実 モデル 野牛",
        "romanizedName": "Ushi Ushi no Mi, Moderu: Baison",
        "englishName": "Ox-Ox Fruit Model Bison",
        "meaning": "Cow",
        "type": "ZOAN",
        "debutChapter": "135",
        "debutEpisode": "81",
        "debutArc": "Drum Island",
        "currentHolder": "Dalton",
        "pastHolders": ["Dalton"],
        "description": "The Ushi Ushi no Mi, Model: Bison, is a Zoan-type Devil Fruit that grants its user the ability to transform into a bison or a bison-human hybrid at will. This power is currently held by Dalton, the leader of the Drum Island Kingdom. The fruit's abilities provide enhanced physical strength, durability, and the natural traits of a bison, such as powerful horns and immense stamina, making it a formidable tool in combat. The user can utilize the bison's traits to charge at opponents with great force or withstand heavy attacks. Additionally, the fruit's hybrid form combines the best attributes of both human and bison, offering versatility in various scenarios. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Ushi Ushi no Mi, Model: Bison, is a powerful and iconic Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/ushi_ushi_model_bison.png"
    },
    {
        "originalName": "ウシウシの実 モデル“麒麟ジラフ”",
        "romanizedName": "Ushi Ushi no Mi, Moderu: Jirafu",
        "englishName": "Ox-Ox Fruit, Model: Giraffe",
        "meaning": "Cow, Qilin",
        "type": "PARAMECIA",
        "debutChapter": "379",
        "debutEpisode": "266",
        "debutArc": "Enies Lobby",
        "currentHolder": "Kaku",
        "pastHolders": ["Kaku"],
        "description": "The Ushi Ushi no Mi, Model: Giraffe, is a Zoan-type Devil Fruit that grants its user the ability to transform into a giraffe or a giraffe-human hybrid at will. This power is currently held by Kaku, a member of CP0 and former CP9 agent. The fruit's abilities provide enhanced physical strength, flexibility, and the natural traits of a giraffe, such as a long neck and powerful legs, making it a unique tool in combat. The user can utilize the giraffe's traits to deliver powerful kicks or headbutts, showcasing the fruit's versatility. Additionally, the fruit's hybrid form combines the best attributes of both human and giraffe, offering strategic advantages in various scenarios. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's combat skills and creativity. Its awakening status remains unknown, and it has not been shown to have any previous holders.",
        "awakeningStatus": true,
        "awakeningDescription": "Upon awakening, the user's Human-Beast form undergoes a physical transformation where their size increases, their body becomes slimmer, their already long neck becomes longer, and dark flame forms a mane down the user's back, arms, neck, and chin, plus a stream of floating dark flame wraps around the user's shoulders.",
        "isCanon": true,
        "imageUrl": "/images/ushi_ushi_model_giraffe.png"
    },
    {
        "originalName": "ウタウタの実",
        "romanizedName": "Uta Uta no Mi",
        "englishName": "Sing-Sing Fruit",
        "meaning": "Song",
        "type": "PARAMECIA",
        "debutChapter": null,
        "debutEpisode": null,
        "debutArc": null,
        "currentHolder": "Uta",
        "pastHolders": ["Uta"],
        "description": "The Uta Uta no Mi, also known as the Sing-Sing Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to transport the consciousness of those who hear their singing into a dream-like world. This power is currently held by Uta, a character from non-canon media. The fruit's abilities allow the user to manipulate the dream world, creating scenarios and controlling the environment to their advantage. While in the dream world, the user can trap opponents, confuse them, or create illusions, making it a powerful tool for both combat and manipulation. However, the fruit's powers are limited by the user's singing range and the need for targets to hear the song. Despite its non-canon status, the Uta Uta no Mi is a fascinating addition to the world of Devil Fruits, showcasing the creative potential of sound-based abilities.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": false,
        "imageUrl": "/images/uta_uta.png"
    },
    {
        "originalName": "ワプワプの実",
        "romanizedName": "Wapu Wapu no Mi",
        "englishName": "Warp-Warp Fruit",
        "meaning": "Warp",
        "type": "PARAMECIA",
        "debutChapter": "1063",
        "debutEpisode": "1093",
        "debutArc": "EggHead",
        "currentHolder": "Van Augur",
        "pastHolders": ["Van Augur"],
        "description": "The Wapu Wapu no Mi, also known as the Warp-Warp Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to teleport themselves and others to any location within their line of sight. This power is currently held by Van Augur, the sniper of the Blackbeard Pirates. The fruit's abilities provide significant advantages in both combat and transportation, allowing the user to evade attacks, reposition allies, or ambush opponents with precision. The user can also teleport objects, adding versatility to their strategic options. Despite its immense potential, the fruit's effectiveness depends on the user's spatial awareness and tactical thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Wapu Wapu no Mi's teleportation capabilities make it a unique and powerful Devil Fruit, capable of reshaping the dynamics of battle and providing unparalleled mobility.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/wapu_wapu.png"
    },
    {
        "originalName": "ウォシュウォシュの実",
        "romanizedName": "Woshu Woshu no Mi",
        "englishName": "Wash-Wash Fruit",
        "meaning": "Wash",
        "type": "PARAMECIA",
        "debutChapter": "556",
        "debutEpisode": "465",
        "debutArc": "Marineford",
        "currentHolder": "Tsuru",
        "pastHolders": ["Tsuru"],
        "description": "The Woshu Woshu no Mi, also known as the Wash-Wash Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to wash and fold living beings and objects as if they were laundry. This power is currently held by Tsuru, a Vice Admiral of the Marines. The fruit's abilities allow the user to cleanse the 'evil' from individuals, temporarily removing their powers or abilities. This unique capability provides both offensive and defensive advantages, enabling the user to neutralize threats or assist allies. The fruit's powers also extend to manipulating the environment, allowing the user to create barriers or traps using the folding technique. Despite its seemingly whimsical nature, the fruit's effectiveness depends on the user's creativity and combat skills. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Woshu Woshu no Mi's washing capabilities make it a unique and intriguing Devil Fruit, capable of surprising opponents with its unconventional applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/woshu_woshu.png"
    },
    {
        "originalName": "ヤミヤミの実",
        "romanizedName": "Yami Yami no Mi",
        "englishName": "Dark-Dark Fruit",
        "meaning": "Darkness",
        "type": "LOGIA",
        "debutChapter": "440",
        "debutEpisode": "325",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Marshall D. Teach",
        "pastHolders": ["Marshall D. Teach"],
        "description": "The Yami Yami no Mi, also known as the Dark-Dark Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into darkness. This power is currently held by Marshall D. Teach, also known as Blackbeard, the captain of the Blackbeard Pirates. The fruit's abilities allow the user to absorb and nullify the powers of other Devil Fruit users, making it a unique and fearsome tool in combat. The user can also create gravitational forces to pull objects or opponents into the darkness, effectively trapping them. Despite its immense power, the fruit comes with significant drawbacks, such as the inability to become intangible like other Logia users, leaving the user vulnerable to attacks. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Yami Yami no Mi's darkness-based capabilities make it one of the most dangerous Devil Fruits in existence.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/yami_yami.png"
    },
    {
        "originalName": "ヨミヨミの実",
        "romanizedName": "Yomi Yomi no Mi",
        "englishName": "Revive-Revive Fruit",
        "meaning": "Resurrection",
        "type": "PARAMECIA",
        "debutChapter": "442",
        "debutEpisode": "337",
        "debutArc": "Thrillers Bark",
        "currentHolder": "Brook",
        "pastHolders": ["Brook"],
        "description": "The Yomi Yomi no Mi, also known as the Revive-Revive Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to return to life after death. This power is currently held by Brook, the musician of the Straw Hat Pirates. The fruit's abilities allow the user to reanimate their body after death, granting them a second life. However, due to the delay in Brook's soul finding his body, he was revived as a skeleton. The fruit also enables the user to manipulate their soul, allowing for unique combat techniques such as separating their soul from their body or emitting soul-based energy. Despite its seemingly limited initial ability, the fruit's potential expands significantly with creativity and mastery. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Yomi Yomi no Mi's resurrection capabilities make it a fascinating and unique Devil Fruit.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/yomi_yomi.png"
    },
    {
        "originalName": "ユキユキの実",
        "romanizedName": "Yuki Yuki no Mi",
        "englishName": "Snow-Snow Fruit",
        "meaning": "Snow",
        "type": "LOGIA",
        "debutChapter": "681",
        "debutEpisode": "607",
        "debutArc": "Punk Hazard",
        "currentHolder": "Unknown",
        "pastHolders": ["Monet"],
        "description": "The Yuki Yuki no Mi, also known as the Snow-Snow Fruit, is a Logia-type Devil Fruit that grants its user the ability to create, control, and transform into snow. This power was previously held by Monet, a member of the Donquixote Pirates. The fruit's abilities allow the user to manipulate snow for both offensive and defensive purposes, such as creating snowstorms, forming barriers, or immobilizing opponents with freezing techniques. The user can also use the snow to obscure visibility, providing strategic advantages in combat. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its abilities. Its awakening status remains unknown, and it has not been shown to have any additional previous holders. The Yuki Yuki no Mi's snow-based capabilities make it a versatile and resourceful Devil Fruit, capable of overwhelming opponents with its dynamic and chilling applications.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/yuki_yuki.png"
    },
    {
        "originalName": "ゾウゾウの実 モデル マンモス",
        "romanizedName": "Zō Zō no Mi Moderu Manmosu",
        "englishName": "Eleph-Eleph Fruit Model Mammoth",
        "meaning": "Elephant",
        "type": "ANCIENT_ZOAN",
        "debutChapter": "807",
        "debutEpisode": "757",
        "debutArc": "Zou",
        "currentHolder": "Jack",
        "pastHolders": ["Jack"],
        "description": "The Zō Zō no Mi, Model: Mammoth, is an Ancient Zoan-type Devil Fruit that grants its user the ability to transform into a mammoth or a mammoth-human hybrid at will. This power is currently held by Jack, one of the All-Stars of the Beast Pirates. The fruit's abilities provide enhanced physical strength, durability, and the natural traits of a mammoth, such as a massive size and powerful tusks, making it a formidable tool in combat. The user can utilize the mammoth's traits to charge at opponents with overwhelming force or withstand heavy attacks. Additionally, the fruit's hybrid form combines the best attributes of both human and mammoth, offering versatility in various scenarios. Despite its seemingly straightforward nature, the fruit's effectiveness depends on the user's combat skills and strategic thinking. Its awakening status remains unknown, and it has not been shown to have any previous holders.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/zou_zou_model_mammoth.png"
    },
    {
        "originalName": "ズシズシの実",
        "romanizedName": "Zushi Zushi no Mi",
        "englishName": "Gravity-Gravity Fruit",
        "meaning": "Sound of heavy stomps",
        "type": "PARAMECIA",
        "debutChapter": "701",
        "debutEpisode": "631",
        "debutArc": "Dressrosa",
        "currentHolder": "Issho Fujitora",
        "pastHolders": ["Issho Fujitora"],
        "description": "The Zushi Zushi no Mi, also known as the Gravity-Gravity Fruit, is a Paramecia-type Devil Fruit that grants its user the ability to manipulate gravitational forces. This power is currently held by Issho, also known as Admiral Fujitora of the Marines. The fruit's abilities allow the user to create powerful gravitational fields, enabling them to pull objects or opponents towards them, repel attacks, or even alter the environment by lifting massive objects like ships or meteors. The user can also use gravity to immobilize enemies or enhance their combat techniques. Despite its immense potential, the fruit's effectiveness depends on the user's creativity and mastery of its powers. Its awakening status remains unknown, and it has not been shown to have any previous holders. The Zushi Zushi no Mi's gravity-based capabilities make it a versatile and formidable Devil Fruit, capable of reshaping the battlefield and overwhelming opponents.",
        "awakeningStatus": false,
        "awakeningDescription": null,
        "isCanon": true,
        "imageUrl": "/images/zushi_zushi.png"
    }
]